tutorials/overset_parallel/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers sixDoFMooring);

application     overInterDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10.8;

deltaT          0.0005;

writeControl    adjustableRunTime; // adjustable; timeStep;

writeInterval   0.225;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no; //yes;

adjustTimeStep  yes;

maxCo           0.5; // 5.0
maxAlphaCo      0.5; // 2.0
maxDeltaT       0.01;

functions
{
/*    limitWrite
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");
        enabled         true;
        log             true;
        writeObjects    yes;
        objects
        (
            ".*"
        );
        writeControl    adjustableRunTime;
        timeStart       5.4;
        writeInterval   0.225;
    }
*/
/*    sixDoF_History
    {
        type           sixDoFRigidBodyState;
        libs           ("libsixDoFRigidBodyState.so");
        angleFormat    radians;//radians, degrees
                
        writeControl   timeStep;
        writeInterval  5;
    }
*/
    interfaceHeight1
    {
        type            interfaceHeight;
        
        libs            ("libfieldFunctionObjects.so");
        
        locations       ((-2.74 0 0) (-0.05 0 0) (0.07 0 0) (0.55 0 0) (1.9 0 0) (2.9 0 0));
        alpha           alpha.water;
        
        writeControl   timeStep;
        writeInterval  5;
    }
}
// ************************************************************************* //
